# SheetGuideGrid Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SheetGuideGrid Property
ParameterTypeId Class See Also
---
"Guide Grid"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SheetGuideGrid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetGuideGrid As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SheetGuideGrid {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace